"""
git init – создание репозитория
git clone - копирование удаленного репозитория
git add – добавляет содержимое рабочего каталога в индекс (staging area) для последующего коммита
git commit – сохраняет/обновляет файлы которые были добавлены с помощью git add во внутреннюю базу данных и добавляет точку «возврата»
git push – отправляет в удаленный репозиторий закоммиченые изменения
git pull – забирает изменения с удаленного репозитория и сливает с текущей веткой
git branch – создание/удаление/переименовывание веток
git checkout – переключение между ветками
git rebase - берет все коммиты из одной ветки и в том же порядке применить их к другой ветке
git merge – слияние одной или нескольких веток в текущую
git cherry-pick – копирует выбранный коммит из одной ветки и применить его к другой
git status – показывает состояния файлов в рабочей директории
git log – просмотр истории коммитов, начиная с самого свежего и уходя к истокам проекта
git reset – используется для отмены изменений
git revert - создает новый коммит, применяющий изменения
обратный для указанного аргумента
git stash – используется для временного сохранения всех незафиксированных изменений без необходимости фиксировать незавершенную работу в текущей ветке
git diff – показывает разницу между ветками или коммитами
"""
